---
kind: method
id: M:Autodesk.Revit.DB.IExportContext.OnLinkEnd(Autodesk.Revit.DB.LinkNode)
source: html/e6680c8d-bfb3-f873-3e3d-24aa8b29061e.htm
---
# Autodesk.Revit.DB.IExportContext.OnLinkEnd Method

This method marks the end of a link instance being exported.

## Syntax (C#)
```csharp
void OnLinkEnd(
	LinkNode node
)
```

## Parameters
- **node** (`Autodesk.Revit.DB.LinkNode`) - An output node that represents a Revit link.